## Plan Result (demo-global)




<pre><code>Plan: 30 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;civil-citizen-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cmc&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fis-ds-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ia-aip&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;lau&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;lau-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv-civil&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pcq&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pcq-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;privatelaw&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;probate&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;rpts&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;civil-citizen-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cmc&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fees-register-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fis-ds-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;ia-aip&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;lau&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;lau-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv-civil&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pcq&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pcq-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;privatelaw&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;probate&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;rpts&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"
        name                                 = "hmcts-demo"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (11 unchanged attributes hidden)

      + backend_pool {
          + health_probe_name   = "healthProbeSettings-fees-register"
          + load_balancing_name = "loadBalancingSettings-fees-register"
          + name                = "fees-register"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "fees-register.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-fees-register-int"
          + load_balancing_name = "loadBalancingSettings-fees-register-int"
          + name                = "fees-register-int"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "fees-register-int.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-fis-ds-web"
          + load_balancing_name = "loadBalancingSettings-fis-ds-web"
          + name                = "fis-ds-web"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "fis-ds-web.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-ia-aip"
          + load_balancing_name = "loadBalancingSettings-ia-aip"
          + name                = "ia-aip"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "immigration-appeal.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-lau"
          + load_balancing_name = "loadBalancingSettings-lau"
          + name                = "lau"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "lau.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-lau-int"
          + load_balancing_name = "loadBalancingSettings-lau-int"
          + name                = "lau-int"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "lau-int.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-cmc"
          + load_balancing_name = "loadBalancingSettings-cmc"
          + name                = "cmc"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "moneyclaims.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-nfdiv"
          + load_balancing_name = "loadBalancingSettings-nfdiv"
          + name                = "nfdiv"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "nfdiv.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-nfdiv-civil"
          + load_balancing_name = "loadBalancingSettings-nfdiv-civil"
          + name                = "nfdiv-civil"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "nfdiv-end-civil-partnership.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pcq"
          + load_balancing_name = "loadBalancingSettings-pcq"
          + name                = "pcq"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "pcq.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pcq-int"
          + load_balancing_name = "loadBalancingSettings-pcq-int"
          + name                = "pcq-int"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "pcq-int.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-privatelaw"
          + load_balancing_name = "loadBalancingSettings-privatelaw"
          + name                = "privatelaw"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "privatelaw.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-probate"
          + load_balancing_name = "loadBalancingSettings-probate"
          + name                = "probate"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "probate.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-rpts"
          + load_balancing_name = "loadBalancingSettings-rpts"
          + name                = "rpts"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "rpts.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-civil-citizen-ui"
          + load_balancing_name = "loadBalancingSettings-civil-citizen-ui"
          + name                = "civil-citizen-ui"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "civil-citizen-ui.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-fees-register"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-fees-register-int"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-fis-ds-web"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-ia-aip"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-lau"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-lau-int"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-cmc"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-nfdiv"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-nfdiv-civil"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-pcq"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-pcq-int"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-privatelaw"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-probate"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-rpts"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-civil-citizen-ui"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-fees-register"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-fees-register-int"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-fis-ds-web"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-ia-aip"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-lau"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-lau-int"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-cmc"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-nfdiv"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-nfdiv-civil"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-pcq"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-pcq-int"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-privatelaw"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-probate"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-rpts"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-civil-citizen-ui"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      ~ frontend_endpoint {
          ~ host_name                               = "www.paymentoutcome-web.demo.platform.hmcts.net" -> "fees-register.demo.platform.hmcts.net"
            id                                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/wwwpaymentoutcome-web"
          ~ name                                    = "wwwpaymentoutcome-web" -> "fees-register"
          + web_application_firewall_policy_link_id = (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "www.paymentoutcome-web-int.demo.platform.hmcts.net" -> "fees-register-int.demo.platform.hmcts.net"
            id                                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/fr

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...


              + selector       = "GroupName"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "NFuse_Application"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "banner_id"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "callback"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "reply_message_template"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "name"
            }
          + exclusion {
              + match_variable = "RequestHeaderNames"
              + operator       = "Equals"
              + selector       = "User-Agent"
            }
          + exclusion {
              + match_variable = "RequestHeaderNames"
              + operator       = "Equals"
              + selector       = "content-type"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "csvFees"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "description"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["fis-ds-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "fisdswebdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "rf"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["ia-aip"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "iaaipdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["lau"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "laudemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["lau-int"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "lauintdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["nfdiv"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "nfdivdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["nfdiv-civil"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "nfdivcivildemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pcq"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "pcqdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "RumBeaconExclusion"
          + priority                       = 100
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "POST",
                ]
              + match_variable     = "RequestMethod"
              + negation_condition = false
              + operator           = "Equal"
            }
          + match_condition {
              + match_values       = [
                  + "/rb_",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "connect.sid"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "_csrf"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "pcq-cookie-preferences"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gat"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtCookie"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtLatC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtPC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxVisitor"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxvt"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pcq-int"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "pcqintdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "RumBeaconExclusion"
          + priority                       = 100
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "POST",
                ]
              + match_variable     = "RequestMethod"
              + negation_condition = false
              + operator           = "Equal"
            }
          + match_condition {
              + match_values       = [
                  + "/rb_",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "connect.sid"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "_csrf"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "pcq-cookie-preferences"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gat"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtCookie"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtLatC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtPC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxVisitor"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxvt"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["privatelaw"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "privatelawdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "rf"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["probate"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "probatedemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "RumBeaconExclusion"
          + priority                       = 100
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "POST",
                ]
              + match_variable     = "RequestMethod"
              + negation_condition = false
              + operator           = "Equal"
            }
          + match_condition {
              + match_values       = [
                  + "/rb_",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + override {
              + rule_group_name = "RCE"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932115"
                }
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["rpts"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "rptsdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 30 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1490,"Program":"tfcmt","SHA1":"","Target":"demo-global","Vars":{}} -->